Repository: zizicici/Doufu
Catalog: Doufu/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

# pip.status.cancelled
source: Cancelled
zh_hans: 已取消
zh_hk: 已取消

# pip.status.completed
source: Completed
zh_hans: 已完成
zh_hk: 已完成

# pip.status.failed
source: Failed
zh_hans: 出错了
zh_hk: 出錯了

# pip.status.needs_action
source: Action Required
zh_hans: 需要操作
zh_hk: 需要操作

# pip.status.started_format
source: %@ — Working…
zh_hans: %@ — 工作中…
zh_hk: %@ — 工作中…

# pip.status.working
source: Working…
zh_hans: 工作中…
zh_hk: 工作中…

# project_settings.action.save
source: Save
zh_hans: 保存
zh_hk: 保存

# project_settings.alert.save_failed.title
source: Save Failed
zh_hans: 保存失败
zh_hk: 保存失敗

# project_settings.chat.tool_permission.default_format
source: Default (%@)
zh_hans: 默认（%@）
zh_hk: 預設（%@）

# project_settings.chat.tool_permission.title
source: Tool Permissions
zh_hans: 工具权限
zh_hk: 工具權限

# project_settings.chat.tool_permission.use_default
source: Use Default
zh_hans: 使用默认
zh_hk: 使用預設

# project_settings.checkpoint.history_subtitle
source: View and restore previous states.
zh_hans: 查看并恢复之前的状态。
zh_hk: 查看並恢復之前的狀態。

# project_settings.checkpoint.history_title
source: Checkpoint History
zh_hans: 检查点历史
zh_hk: 檢查點歷史

# project_settings.checkpoint.undo_button
source: Undo Last AI Change
zh_hans: 撤销上次 AI 更改
zh_hk: 撤銷上次 AI 變更

# project_settings.code_scan.subtitle
source: Static analysis and LLM review
zh_hans: 静态分析和 LLM 审查
zh_hk: 靜態分析和 LLM 審查

# project_settings.code_scan.title
source: Code Review
zh_hans: 代码审查
zh_hk: 程式碼審查

# project_settings.default_model.footer
source: This default model applies only to the current project. Each thread can still override it.
zh_hans: 这个默认模型只对当前项目生效。每个会话仍可单独覆盖。
zh_hk: 此預設模型只對目前項目生效。每個會話仍可單獨覆蓋。

# project_settings.default_model.invalid
source: Invalid Project Default
zh_hans: 项目默认模型无效
zh_hk: 項目預設模型無效

# project_settings.default_model.provider_hint
source: Choose Use App Default to inherit the app model, or select a provider first and then choose a project model.
zh_hans: 选择“使用 App 默认”可继承全局模型；如需项目级默认值，请先选择供应商，再选择模型。
zh_hk: 選擇「使用 App 預設」可繼承全域模型；如需項目級預設值，請先選擇供應商，再選擇模型。

# project_settings.default_model.title
source: Default Model
zh_hans: 默认模型
zh_hk: 預設模型

# project_settings.default_model.use_app_default
source: Use App Default
zh_hans: 使用 App 默认
zh_hk: 使用 App 預設

# project_settings.description_editor.save_failed.title
source: Failed to Save Description
zh_hans: 保存描述失败
zh_hk: 儲存描述失敗

# project_settings.description_editor.title
source: Project Description
zh_hans: 项目描述
zh_hk: 項目描述

# project_settings.field.description_empty
source: No description
zh_hans: 暂无描述
zh_hk: 暫無描述

# project_settings.field.description_title
source: Description
zh_hans: 描述
zh_hk: 描述

# project_settings.field.name_placeholder
source: Project name
zh_hans: 项目名称
zh_hk: 項目名稱

# project_settings.field.name_title
source: Name
zh_hans: 名称
zh_hk: 名稱

# project_settings.footer.checkpoints
source: Checkpoints are created automatically before each AI conversation. You can undo the latest change or restore to any previous checkpoint.
zh_hans: 每次 AI 对话前自动创建检查点。您可以撤销最近的更改或恢复到任意历史检查点。
zh_hk: 每次 AI 對話前自動建立檢查點。您可以撤銷最近的變更或恢復到任意歷史檢查點。

# project_settings.footer.project_name_usage
source: Project name is used on the home page and in project info displays.
zh_hans: 项目名称会用于首页和项目信息展示。
zh_hk: 項目名稱會用於首頁和項目信息展示。

# project_settings.footer.snapshot_limit
source: Up to 10 manual snapshots and 10 chat auto snapshots are retained.
zh_hans: 手动快照与聊天自动快照分别最多保留 10 条。
zh_hk: 手動快照與聊天自動快照分別最多保留 10 條。

# project_settings.footer.storage
source: Clearing storage will reload the web page.
zh_hans: 清除存储将重新加载网页。
zh_hk: 清除儲存將重新載入網頁。

# project_settings.footer.tool_permission
source: Controls how much autonomy the AI has when using tools. Higher autonomy means fewer confirmation prompts.
zh_hans: 控制 AI 使用工具时的自主程度。自主程度越高，确认提示越少。
zh_hk: 控制 AI 使用工具時的自主程度。自主程度越高，確認提示越少。

# project_settings.section.capabilities
source: Permissions
zh_hans: 权限
zh_hk: 權限

# project_settings.section.chat
source: Chat
zh_hans: 聊天
zh_hk: 聊天

# project_settings.section.checkpoints
source: Checkpoints
zh_hans: 检查点
zh_hk: 檢查點

# project_settings.section.code_scan
source: Security
zh_hans: 安全
zh_hk: 安全

# project_settings.section.project
source: Project
zh_hans: 项目
zh_hk: 項目

# project_settings.section.snapshots
source: Snapshots
zh_hans: 快照
zh_hk: 快照

# project_settings.section.storage
source: Storage
zh_hans: 存储
zh_hk: 儲存

# project_settings.snapshot.load_subtitle
source: Choose a snapshot to restore the project
zh_hans: 选择一个快照恢复到项目
zh_hk: 選擇一個快照恢復到項目

# project_settings.snapshot.load_title
source: Load Snapshot
zh_hans: 载入快照
zh_hk: 載入快照

# project_settings.snapshot.save_button
source: Save Snapshot
zh_hans: 保存快照
zh_hk: 保存快照

# project_settings.storage.clear
source: Clear
zh_hans: 清除
zh_hk: 清除

# project_settings.storage.clear_indexeddb
source: Clear IndexedDB
zh_hans: 清除 IndexedDB
zh_hk: 清除 IndexedDB

# project_settings.storage.clear_indexeddb.alert.message
source: All IndexedDB data for this project will be deleted. The web page will reload.
zh_hans: 此项目的所有 IndexedDB 数据将被删除，网页将重新加载。
zh_hk: 此項目的所有 IndexedDB 資料將被刪除，網頁將重新載入。

# project_settings.storage.clear_indexeddb.alert.title
source: Clear IndexedDB
zh_hans: 清除 IndexedDB
zh_hk: 清除 IndexedDB

# project_settings.storage.clear_local_storage
source: Clear localStorage
zh_hans: 清除 localStorage
zh_hk: 清除 localStorage

# project_settings.storage.clear_local_storage.alert.message
source: All localStorage data for this project will be deleted. The web page will reload.
zh_hans: 此项目的所有 localStorage 数据将被删除，网页将重新加载。
zh_hk: 此項目的所有 localStorage 資料將被刪除，網頁將重新載入。

# project_settings.storage.clear_local_storage.alert.title
source: Clear localStorage
zh_hans: 清除 localStorage
zh_hk: 清除 localStorage

# project_settings.title
source: Project Settings
zh_hans: 项目设置
zh_hk: 項目設置

# project_settings.unnamed_project
source: Untitled Project
zh_hans: 未命名项目
zh_hk: 未命名項目

# project_snapshot.kind.auto
source: Auto Snapshot
zh_hans: 自动快照
zh_hk: 自動快照

# project_snapshot.kind.manual
source: Manual Snapshot
zh_hans: 手动快照
zh_hk: 手動快照

# project_store.default_project_name
source: Untitled
zh_hans: 未命名
zh_hk: 未命名

# project_store.error.invalid_project_location
source: Invalid project path. Cannot delete.
zh_hans: 项目路径无效，无法删除。
zh_hk: 項目路徑無效，無法刪除。

# project_store.error.invalid_project_name
source: Project name cannot be empty.
zh_hans: 项目名称不能为空。
zh_hk: 項目名稱不能為空。

# project_store.error.project_creation_failed
source: Failed to create project. Please try again later.
zh_hans: 创建项目失败，请稍后重试。
zh_hk: 創建項目失敗，請稍後重試。

# project_store.error.project_deletion_failed
source: Failed to delete project. Please try again later.
zh_hans: 删除项目失败，请稍后重试。
zh_hk: 刪除項目失敗，請稍後重試。

# project_store.error.snapshot_create_failed
source: Failed to create snapshot. Please try again later.
zh_hans: 创建快照失败，请稍后重试。
zh_hk: 創建快照失敗，請稍後重試。

# project_store.error.snapshot_not_found
source: Snapshot does not exist or has been cleaned up.
zh_hans: 快照不存在或已被清理。
zh_hk: 快照不存在或已被清理。

# project_store.error.snapshot_read_failed
source: Failed to read snapshot. Please try again later.
zh_hans: 读取快照失败，请稍后重试。
zh_hk: 讀取快照失敗，請稍後重試。

# project_store.error.snapshot_restore_failed
source: Failed to load snapshot. Please try again later.
zh_hans: 载入快照失败，请稍后重试。
zh_hk: 載入快照失敗，請稍後重試。

# project_store.error.unavailable_documents_directory
source: Cannot access local documents directory.
zh_hans: 无法访问本地文档目录。
zh_hk: 無法訪問本地文檔目錄。

# project_template.blank_page.hint.chat
source: Use chat to tell AI what you want to build.
zh_hans: 通过聊天告诉 AI 你想要实现的效果。
zh_hk: 通過聊天告訴 AI 你想要實現的效果。

# project_template.blank_page.hint.empty
source: This is a blank page.
zh_hans: 这是一个空白页面。
zh_hk: 這是一個空白頁面。

# project_template.blank_page.tag
source: Blank Project
zh_hans: 空白项目
zh_hk: 空白項目

# project_template.description.iterate_by_chat
source: Keep improving code through chat.
zh_hans: 通过聊天持续更新代码。
zh_hk: 通過聊天持續更新代碼。

# project_template.onboarding.hint
source: 点击菜单，通过对话开发你的应用
zh_hk: 點擊選單，透過對話開發你的應用

# project_template.prompt.blank_web_project
source: Blank web project
zh_hans: 空白网页项目
zh_hk: 空白網頁項目

# provider_model.action.add_custom_model
source: Add Custom Model
zh_hans: 添加自定义模型
zh_hk: 新增自定義模型

# provider_model.action.add_custom_model.subtitle
source: Register a model that is not returned by the provider API.
zh_hans: 注册提供商 API 未返回的模型。
zh_hk: 註冊提供商 API 未返回的模型。

# provider_model.action.refresh_models
source: Refresh Official Models
zh_hans: 刷新官方模型
zh_hk: 重新整理官方模型

# provider_model.action.refresh_models.subtitle
source: Pull the latest model list from the provider API.
zh_hans: 从提供商 API 拉取最新模型列表。
zh_hk: 從提供商 API 拉取最新模型列表。

# provider_model.action.refreshing_models
source: Refreshing Official Models...
zh_hans: 正在刷新官方模型…
zh_hk: 正在重新整理官方模型…

# provider_model.alert.refresh_failed.title
source: Refresh Failed
zh_hans: 刷新失败
zh_hk: 重新整理失敗

# provider_model.alert.save_failed.title
source: Save Failed
zh_hans: 保存失败
zh_hk: 保存失敗

# provider_model.editor.button.save
source: Save Model
zh_hans: 保存模型
zh_hk: 保存模型

# provider_model.editor.field.context_window
source: Context Window
zh_hans: 上下文窗口
zh_hk: 上下文視窗

# provider_model.editor.field.context_window.placeholder
source: Auto
zh_hans: 自动
zh_hk: 自動

# provider_model.editor.field.display_name
source: Display Name
zh_hans: 显示名称
zh_hk: 顯示名稱

# provider_model.editor.field.display_name.placeholder
source: Optional
zh_hans: 可选
zh_hk: 可選

# provider_model.editor.field.max_output_tokens
source: Max Output Tokens
zh_hans: 最大输出 Tokens
zh_hk: 最大輸出 Tokens

# provider_model.editor.field.max_output_tokens.placeholder
source: Auto
zh_hans: 自动
zh_hk: 自動

# provider_model.editor.field.model_id
source: Model ID
zh_hans: 模型 ID
zh_hk: 模型 ID

# provider_model.editor.reasoning_format
source: Reasoning: %@
zh_hans: 推理：%@
zh_hk: 推理：%@

# provider_model.editor.section.capabilities
source: Capabilities
zh_hans: 能力
zh_hk: 能力

# provider_model.editor.section.identity
source: Identity
zh_hans: 标识
zh_hk: 標識

# provider_model.editor.section.thinking
source: Thinking
zh_hans: 思考
zh_hk: 思考

# provider_model.editor.section.token_limits
source: Token Limits
zh_hans: Token 限制
zh_hk: Token 限制

# provider_model.editor.structured_output
source: Structured Output
zh_hans: 结构化输出
zh_hk: 結構化輸出

# provider_model.editor.thinking_can_disable
source: Thinking Can Disable
zh_hans: 思考可关闭
zh_hk: 思考可關閉

# provider_model.editor.thinking_supported
source: Thinking Supported
zh_hans: 支持思考
zh_hk: 支持思考

# provider_model.editor.title.add
source: Add Model
zh_hans: 添加模型
zh_hk: 新增模型

# provider_model.editor.title.detail
source: Model Detail
zh_hans: 模型详情
zh_hk: 模型詳情

# provider_model.editor.title.edit
source: Edit Model
zh_hans: 编辑模型
zh_hk: 編輯模型

# provider_model.section.manage_models
source: Manage Models
zh_hans: 管理模型
zh_hk: 管理模型

# provider_model.section.stored_models
source: Stored Models
zh_hans: 已存储模型
zh_hk: 已儲存模型

# provider_model.source.custom
source: Custom
zh_hans: 自定义
zh_hk: 自定義

# provider_model.source.official
source: Official
zh_hans: 官方
zh_hk: 官方

# provider_model.stored_models.empty
source: No models stored.
zh_hans: 暂无已存储的模型。
zh_hk: 暫無已儲存的模型。

# provider_store.error.empty_api_key
source: Please enter an API Key.
zh_hans: 请输入 API Key。
zh_hk: 請輸入 API Key。

# provider_store.error.empty_label
source: Please enter a provider name.
zh_hans: 请输入提供商名称。
zh_hk: 請輸入提供商名稱。

# provider_store.error.empty_model_id
source: Model ID cannot be empty.
zh_hans: 模型 ID 不能为空。
zh_hk: 模型 ID 不能為空。

# provider_store.error.encode_failed
source: Failed to save provider. Please try again later.
zh_hans: 提供商保存失败，请稍后重试。
zh_hk: 提供商保存失敗，請稍後重試。

# provider_store.error.invalid_base_url
source: Invalid custom URL. Please enter an http(s) URL.
zh_hans: 自定义地址格式无效，请输入 http(s) 地址。
zh_hk: 自定義地址格式無效，請輸入 http(s) 地址。

# provider_store.error.keychain_failed
source: Failed to save secret. Please try again later.
zh_hans: 密钥保存失败，请稍后重试。
zh_hk: 密鑰保存失敗，請稍後重試。

# provider_store.error.provider_not_found
source: Provider not found. It may have been deleted.
zh_hans: 未找到提供商，可能已被删除。
zh_hk: 未找到提供商，可能已被刪除。

# providers.add.section.provider_type
source: Provider Type
zh_hans: 提供商类型
zh_hk: 提供商類型

# providers.add.title
source: Add Provider
zh_hans: 添加提供商
zh_hk: 添加提供商

# providers.api_key_form.section.custom_api
source: Custom API Base URL (Optional)
zh_hans: 自定义 API 地址（可选）
zh_hk: 自定義 API 地址（可選）

# providers.api_key_form.toggle.auto_append_v1
source: Auto Append "/v1"
zh_hans: 自动追加 "/v1"
zh_hk: 自動追加 "/v1"

# providers.auth_method.api_key.subtitle
source: Add provider using API Key
zh_hans: 通过 API Key 添加提供商
zh_hk: 通過 API Key 添加提供商

# providers.auth_method.oauth.openai.subtitle
source: Sign in with your OpenAI account via OAuth
zh_hans: 通过 OAuth 登录你的 OpenAI 账户
zh_hk: 透過 OAuth 登入你的 OpenAI 帳戶

# providers.auth_method.oauth.openrouter.subtitle
source: Sign in with your OpenRouter account via OAuth PKCE
zh_hans: 通过 OAuth PKCE 登录你的 OpenRouter 账户
zh_hk: 透過 OAuth PKCE 登入你的 OpenRouter 帳戶

# providers.auth_method.oauth.subtitle
source: After successful login, URL and Bearer Token will be filled automatically
zh_hans: 登录成功后自动填入网址与 Bearer Token
zh_hk: 登錄成功後自動填入網址與 Bearer Token

# providers.auth_method.section.title
source: Method
zh_hans: 认证方式
zh_hk: 認證方式

# providers.auth_method.title
source: Authentication Method
zh_hans: 认证方式
zh_hk: 認證方式

# providers.form.alert.add_failed.title
source: Add Failed
zh_hans: 添加失败
zh_hk: 添加失敗

# providers.form.alert.add_success.message_format
source: Provider "%@" has been added.
zh_hans: 提供商「%@」已添加。
zh_hk: 提供商「%@」已添加。

# providers.form.alert.add_success.title
source: Added
zh_hans: 添加成功
zh_hk: 添加成功

# providers.form.button.add_provider
source: Add Provider
zh_hans: 添加提供商
zh_hk: 添加提供商

# providers.form.footer.base_url_default
source: Leave blank to use https://api.openai.com by default
zh_hans: 留空时默认使用 https://api.openai.com
zh_hk: 留空時默認使用 https://api.openai.com

# providers.form.placeholder.provider_name
source: Provider Name
zh_hans: 提供商名称
zh_hk: 提供商名稱

# providers.form.section.label
source: Label
zh_hans: 标签
zh_hk: 標籤

# providers.kind.anthropic.subtitle
source: Anthropic official or compatible API services
zh_hans: Anthropic 官方或兼容 Anthropic API 的服务
zh_hk: Anthropic 官方或兼容 Anthropic API 的服務

# providers.kind.anthropic.title
source: Anthropic / Compatible API
zh_hans: Anthropic / 兼容 API
zh_hk: Anthropic / 兼容 API

# providers.kind.openai_compatible.subtitle
source: OpenAI official or OpenAI-compatible API services
zh_hans: OpenAI 官方或兼容 OpenAI API 的服务
zh_hk: OpenAI 官方或兼容 OpenAI API 的服務

# providers.kind.openai_compatible.title
source: OpenAI / Compatible API
zh_hans: OpenAI / 兼容 API
zh_hk: OpenAI / 兼容 API

# providers.manage.alert.delete_failed.title
source: Delete Failed
zh_hans: 删除失败
zh_hk: 刪除失敗

# providers.manage.empty
source: No providers yet
zh_hans: 还没有提供商
zh_hk: 還沒有提供商

# providers.manage.footer.delete_hint
source: Swipe left to delete a provider.
zh_hans: 左滑可删除提供商。
zh_hk: 左滑可刪除提供商。

# providers.manage.footer.empty_hint
source: Tap + at top right to add your first provider.
zh_hans: 点击右上角 + 添加第一个提供商。
zh_hk: 點擊右上角 + 添加第一個提供商。

# providers.manage.item.token_usage
source: Token Usage
zh_hans: Token 使用量
zh_hk: Token 使用量

# providers.manage.item.token_usage.subtitle
source: View total and provider model usage
zh_hans: 查看总量和各服务商/模型使用情况
zh_hk: 查看總量和各服務商/模型使用情況

# providers.manage.section.configured
source: Configured Providers
zh_hans: 已配置提供商
zh_hk: 已配置提供商

# providers.manage.title
source: Providers
zh_hans: 提供商
zh_hk: 提供商

# providers.oauth_form.button.sign_in
source: Sign in with OpenAI
zh_hans: 使用 OpenAI 登录
zh_hk: 使用 OpenAI 登錄

# providers.oauth_form.error.empty_token
source: Please sign in first or fill in Bearer Token directly.
zh_hans: 请先登录成功，或直接填写 Bearer Token。
zh_hk: 請先登錄成功，或直接填寫 Bearer Token。

# providers.oauth_form.footer.oauth
source: Tap to open OpenAI sign-in. URL and Bearer Token will be filled automatically after success.
zh_hans: 点击后将跳转 OpenAI 登录，成功后将自动填入网址和 Bearer Token。
zh_hk: 點擊後將跳轉 OpenAI 登錄，成功後將自動填入網址和 Bearer Token。

# providers.oauth_form.section.manual
source: Or Configure Manually
zh_hans: 或手动配置
zh_hk: 或手動配置

# providers.usage.breakdown.empty
source: No token usage yet
zh_hans: 暂无 Token 使用记录
zh_hk: 暫無 Token 使用記錄

# providers.usage.breakdown.footer.empty
source: Usage data will appear after model requests complete.
zh_hans: 完成模型请求后，这里会显示使用数据。
zh_hk: 完成模型請求後，這裡會顯示使用數據。

# providers.usage.breakdown.item.subtitle_format
source: %@ · Input %@ · Output %@
zh_hans: %@ · 输入 %@ · 输出 %@
zh_hk: %@ · 輸入 %@ · 輸出 %@

# providers.usage.detail.input
source: Input Tokens
zh_hans: 输入 Token
zh_hk: 輸入 Token

# providers.usage.detail.output
source: Output Tokens
zh_hans: 输出 Token
zh_hk: 輸出 Token

# providers.usage.section.breakdown
source: By Provider & Model
zh_hans: 按服务商与模型
zh_hk: 按服務商與模型

# providers.usage.section.total
source: Total Usage
zh_hans: 总用量
zh_hk: 總用量

# providers.usage.title
source: Token Usage
zh_hans: Token 使用量
zh_hk: Token 使用量

# providers.usage.tokens_format
source: %@ tokens
zh_hans: %@ Token
zh_hk: %@ Token

# providers.usage.total.input
source: Total Input Tokens
zh_hans: 总输入 Token
zh_hk: 總輸入 Token

# providers.usage.total.output
source: Total Output Tokens
zh_hans: 总输出 Token
zh_hk: 總輸出 Token

# providers.usage.used_tokens_format
source: Used %@
zh_hans: 已用 %@
zh_hk: 已用 %@

# scan.action.cancel_import
source: Cancel Import
zh_hans: 取消导入
zh_hk: 取消匯入

# scan.action.close
source: Close
zh_hans: 关闭
zh_hk: 關閉

# scan.action.confirm_import
source: Confirm Import
zh_hans: 确认导入
zh_hk: 確認匯入

# scan.action.skip
source: Skip
zh_hans: 跳过
zh_hk: 跳過

# scan.action.start_llm
source: Start LLM Review
zh_hans: 开始 LLM 审查
zh_hk: 開始 LLM 審查

# scan.appdata_warning
source: This archive includes pre-populated app data (AppData/) that has not been scanned.
zh_hans: 此归档包含预填充的应用数据（AppData/），该数据未经扫描。
zh_hk: 此封存包含預填充嘅應用程式資料（AppData/），該資料未經掃描。

# scan.blocked.message
source: Import not allowed — AI analysis detected potentially malicious code.
zh_hans: 不允许导入 — AI 分析检测到潜在恶意代码。
zh_hk: 不允許匯入 — AI 分析檢測到潛在惡意程式碼。

# scan.category.binary_files
source: Non-Auditable Binary Files
zh_hans: 不可审查的二进制文件
zh_hk: 不可審查的二進位檔案

# scan.category.data_exfiltration
source: Data Exfiltration
zh_hans: 数据外泄
zh_hk: 資料外洩

# scan.category.doufu_api
source: Doufu API Usage
zh_hans: Doufu API 使用
zh_hk: Doufu API 使用

# scan.category.execution
source: Dynamic Execution
zh_hans: 动态执行
zh_hk: 動態執行

# scan.category.external_refs
source: External References
zh_hans: 外部引用
zh_hk: 外部參照

# scan.category.network
source: Network Access
zh_hans: 网络访问
zh_hk: 網絡存取

# scan.category.obfuscation
source: Obfuscation
zh_hans: 代码混淆
zh_hk: 程式碼混淆

# scan.confirm.high_risk
source: Automated scans found potentially risky code patterns. Import only if you fully trust the source.
zh_hans: 自动扫描发现潜在风险代码模式。请仅在完全信任来源时导入。
zh_hk: 自動掃描發現潛在風險程式碼模式。請僅喺完全信任來源時匯入。

# scan.confirm.low_risk
source: Automated scans found no significant issues, but this does not guarantee safety.
zh_hans: 自动扫描未发现重大问题，但这不代表绝对安全。
zh_hk: 自動掃描未發現重大問題，但唔代表絕對安全。

# scan.confirm.medium_risk
source: Automated scans found patterns that may warrant attention. Review the findings above carefully.
zh_hans: 自动扫描发现一些可能需要注意的模式，请仔细查看以上检测结果。
zh_hk: 自動掃描發現一些可能需要注意嘅模式，請仔細查看以上檢測結果。

# scan.confirm.message_format
source: %@ This project was created by a third party and its code will run on your device. By importing it, you accept all risks.
zh_hans: %@ 此项目由第三方创建，其代码将在你的设备上运行。导入即表示你接受全部风险。
zh_hk: %@ 此專案由第三方建立，其程式碼將喺你嘅裝置上執行。匯入即表示你接受全部風險。

# scan.confirm.title
source: Confirm Import
zh_hans: 确认导入
zh_hk: 確認匯入

# scan.finding.atob
source: Decodes base64 data (atob)
zh_hans: 解码 base64 数据 (atob)
zh_hk: 解碼 base64 資料 (atob)

# scan.finding.beacon
source: Sends data via navigator.sendBeacon
zh_hans: 通过 navigator.sendBeacon 发送数据
zh_hk: 透過 navigator.sendBeacon 傳送資料

# scan.finding.binary_file
source: Binary file cannot be audited (.%@)
zh_hans: 二进制文件无法审查 (.%@)
zh_hk: 二進位檔案無法審查 (.%@)

# scan.finding.clipboard
source: Uses Clipboard API
zh_hans: 使用剪贴板 API
zh_hk: 使用剪貼簿 API

# scan.finding.cookie
source: Accesses document.cookie
zh_hans: 访问 document.cookie
zh_hk: 存取 document.cookie

# scan.finding.document_write
source: Uses document.write
zh_hans: 使用 document.write
zh_hk: 使用 document.write

# scan.finding.doufu_camera
source: Uses doufu.camera (Camera access)
zh_hans: 使用 doufu.camera（相机访问）
zh_hk: 使用 doufu.camera（相機存取）

# scan.finding.doufu_clipboard
source: Uses doufu.clipboard (Clipboard access)
zh_hans: 使用 doufu.clipboard（剪贴板访问）
zh_hk: 使用 doufu.clipboard（剪貼簿存取）

# scan.finding.doufu_db
source: Uses doufu.db (Database access)
zh_hans: 使用 doufu.db（数据库访问）
zh_hk: 使用 doufu.db（資料庫存取）

# scan.finding.doufu_location
source: Uses doufu.location (Location access)
zh_hans: 使用 doufu.location（位置访问）
zh_hk: 使用 doufu.location（位置存取）

# scan.finding.doufu_mic
source: Uses doufu.mic (Microphone access)
zh_hans: 使用 doufu.mic（麦克风访问）
zh_hk: 使用 doufu.mic（麥克風存取）

# scan.finding.doufu_photos
source: Uses doufu.photos (Photos access)
zh_hans: 使用 doufu.photos（照片访问）
zh_hk: 使用 doufu.photos（照片存取）

# scan.finding.eval
source: Uses eval() for dynamic code execution
zh_hans: 使用 eval() 动态执行代码
zh_hk: 使用 eval() 動態執行程式碼

# scan.finding.eventsource
source: Opens a Server-Sent Events connection
zh_hans: 打开 Server-Sent Events 连接
zh_hk: 開啟 Server-Sent Events 連線

# scan.finding.external_iframe
source: Embeds external iframe
zh_hans: 嵌入外部 iframe
zh_hk: 嵌入外部 iframe

# scan.finding.external_image
source: Loads external image
zh_hans: 加载外部图片
zh_hk: 載入外部圖片

# scan.finding.external_link
source: Links external stylesheet/resource
zh_hans: 引用外部样式表/资源
zh_hk: 參照外部樣式表/資源

# scan.finding.external_script
source: Loads external script
zh_hans: 加载外部脚本
zh_hk: 載入外部腳本

# scan.finding.fetch_external
source: Fetches data from an external URL
zh_hans: 从外部 URL 获取数据
zh_hk: 從外部 URL 擷取資料

# scan.finding.fetch_protocol_relative
source: Fetches data from a protocol-relative URL
zh_hans: 从协议相对 URL 获取数据
zh_hk: 從協定相對 URL 擷取資料

# scan.finding.forms
source: Accesses document.forms
zh_hans: 访问 document.forms
zh_hk: 存取 document.forms

# scan.finding.fromcharcode
source: String.fromCharCode with many arguments
zh_hans: String.fromCharCode 含大量参数
zh_hk: String.fromCharCode 含大量參數

# scan.finding.geolocation
source: Uses Geolocation API
zh_hans: 使用地理位置 API
zh_hk: 使用地理位置 API

# scan.finding.getusermedia
source: Requests camera or microphone
zh_hans: 请求相机或麦克风
zh_hk: 要求相機或麥克風

# scan.finding.hex_encoded
source: Hex-encoded string sequence
zh_hans: 十六进制编码字符串序列
zh_hk: 十六進位編碼字串序列

# scan.finding.multiple_locations
source: %d occurrences in %d files
zh_hans: %d 处匹配，涉及 %d 个文件
zh_hk: %d 處匹配，涉及 %d 個檔案

# scan.finding.new_function
source: Creates Function via constructor
zh_hans: 通过构造函数创建 Function
zh_hk: 透過建構函式建立 Function

# scan.finding.session_storage
source: Accesses sessionStorage
zh_hans: 访问 sessionStorage
zh_hk: 存取 sessionStorage

# scan.finding.setinterval_string
source: setInterval with string argument (implicit eval)
zh_hans: setInterval 使用字符串参数（隐式 eval）
zh_hk: setInterval 使用字串參數（隱式 eval）

# scan.finding.settimeout_string
source: setTimeout with string argument (implicit eval)
zh_hans: setTimeout 使用字符串参数（隐式 eval）
zh_hk: setTimeout 使用字串參數（隱式 eval）

# scan.finding.unicode_encoded
source: Unicode-encoded string sequence
zh_hans: Unicode 编码字符串序列
zh_hk: Unicode 編碼字串序列

# scan.finding.websocket
source: Opens a WebSocket connection
zh_hans: 打开 WebSocket 连接
zh_hk: 開啟 WebSocket 連線

# scan.finding.xhr
source: Creates XMLHttpRequest
zh_hans: 创建 XMLHttpRequest
zh_hk: 建立 XMLHttpRequest

# scan.info.files
source: Files
zh_hans: 文件数
zh_hk: 檔案數

# scan.info.name
source: Name
zh_hans: 名称
zh_hk: 名稱

# scan.info.size
source: Size
zh_hans: 大小
zh_hk: 大小

# scan.llm.done
source: Complete
zh_hans: 完成
zh_hk: 完成

# scan.llm.failed
source: Failed
zh_hans: 失败
zh_hk: 失敗

# scan.llm.malicious
source: Malicious Detected
zh_hans: 检测到恶意代码
zh_hk: 檢測到惡意程式碼

# scan.llm.no_source_files
source: No source files found.
zh_hans: 未找到源文件。
zh_hk: 未找到原始檔案。

# scan.llm.parse_failed
source: Failed to parse AI response.
zh_hans: AI 响应解析失败。
zh_hk: AI 回應解析失敗。
